export interface Product {
  title: string;
  price: string;
  term?: string;
}

export interface Category {
  title: string;
  products: Product[];
}

export interface ProductCatalog {
  title: string;
  categories: Category[];
}

export const prices: ProductCatalog[] = [
  {
    title: "МДФ фасады крашенные (собственное производство).",
    categories: [
      {
        title: "МДФ фасады прямые 16мм",
        products: [
          {
            title: "Матовый цвет, белый (RAL9003) ",
            price: "8700",
            term: "8",
          },
          {
            title: "Матовый цвет по каталогу (RAL,NCS)",
            price: "9000",
            term: "8",
          },
          {
            title: "Матовый цвет металлик ",
            price: "13000",
            term: "8",
          },
          {
            title: "Глянцевый цвет, белый (RAL9003) ",
            price: "10400",
            term: "15",
          },
          {
            title: "Глянцевый  цвет по каталогу (RAL,NCS)",
            price: "10700",
            term: "15",
          },
          {
            title: "Глянцевый  цвет металлик",
            price: "14700",
            term: "15",
          },
          {
            title: "<b>МДФ фасады  прямые 10мм. </b>",
            price: "-1000",
            term: "-",
          },
          {
            title: "<b>МДФ фасады  прямые 19мм. </b>",
            price: "+300",
            term: "-",
          },
          {
            title: "<b>МДФ фасады  прямые 22мм. </b>",
            price: "+1600",
            term: "+2",
          },
          {
            title: "<b>МДФ фасады  прямые 24мм. </b>",
            price: "+2400",
            term: "+2",
          },
          {
            title: "<b>МДФ фасады  прямые 38мм. </b>",
            price: "+3200",
            term: "+2",
          },
          {
            title: "<b>Другие толщины </b>",
            price: "Обговаривается",
          },
        ],
      },

      {
        title: "МДФ фасады радиальные фасады",
        products: [
          {
            title: "Высота до 100,штука, мат./глянц.",
            price: "6300/7800",
            term: "+20",
          },
          {
            title: "Высота до 716,штука, мат./глянц.",
            price: "8000/9500",
            term: "+20",
          },
          {
            title: "716-956,штука, мат./глянц.",
            price: "8800/10300",
            term: "+20",
          },
          {
            title: "<b>Фасады с фрезеровкой</b>",
            price: "индивидуально",
            term: "30",
          },
          {
            title: "Фасады с фрезировкой не входящей в каталог",
            price: "обговаривается",
          },
          {
            title: "<b>Фасады с интегрированной ручкой L,U,C</b>",
            price: "750 метр",
            term: "+3",
          },
          {
            title: "Фасады с интегрированной ручкой (антрисольной) “А”",
            price: "1100 метр",
            term: "+3",
          },
          {
            title: "Фасады с интегрированной ручкой спил 45 гр. внутренняя",
            price: "400 метр",
            term: "+1",
          },
          {
            title: "Покраска интегрированной ручки в другой цвет",
            price: "2000 метр",
            term: "+3",
          },
          {
            title: "<b>Фасады с вставкой стекла </b>",
            price: "+2000 ",
            term: "+3",
          },
          {
            title: "Четверть с внутренней стороны под стекло (голый мдф)",
            price: "+400",
            term: "+3",
          },
          {
            title:
              "Четверть с внутренней стороны под стекло (цвет белый, грунт)",
            price: "+1000",
          },
          {
            title: "<b>Нанесение патины на фрезеровки   </b>",
            price: "+2200 к стоимости глянцевых фасадов",
            term: "+5",
          },
          {
            title: "Нанесение патины на фрезировки не входящие в каталог",
            price: "обговаривается",
          },
          {
            title: "Нанесение изображения, трафаретт(под лак)",
            price: "обговаривается",
          },
        ],
      },
      {
        title: "Покраска обратной стороны фасадов: ",
        products: [
          {
            title:
              "На ламинацию (возможно сохранение неровностей поверхности):",
            price: "3800",
            term: "+3",
          },
          {
            title: "Матовый цвет" + "</br>Глянцевый цвет",
            price: "5300",
            term: "+3",
          },
        ],
      },
      {
        title: "Перекрас крашенных фасадов ",
        products: [
          {
            title: "<b>Без грунтования:</b>",
            price: "",
            term: "",
          },
          {
            title: "Матовый цвет по каталогу RAL,NCS",
            price: "3900",
            term: "5",
          },
          {
            title: "Глянцевый  цвет по каталогу RAL,NCS",
            price: "5500",
            term: "7",
          },
          {
            title: "<b>С грунтованием:</b>",
            price: "",
          },
          {
            title: "Матовый цвет по каталогу RAL,NCS",
            price: "7000",
            term: "7",
          },
          {
            title: "Глянцевый  цвет по каталогу RAL,NCS",
            price: "8600",
            term: "14",
          },
        ],
      },
      {
        title: "Карниз",
        products: [
          {
            title: "Карниз стандартный (80мм.*2000мм.), метр. (матовый)",
            price: "3000",
            term: "18",
          },
          {
            title: "Карниз стандартный (80мм.*2000мм.), метр. (глянец)",
            price: "3600",
            term: "18",
          },
        ],
      },
      {
        title: "Покраска карниза в пленке",
        products: [
          {
            title: "Покраска карниза в пленке, метр. (матовый)",
            price: "2600",
            term: "5",
          },
          {
            title: "Покраска карниза в пленке, метр. (глянец)",
            price: "3800",
            term: "5",
          },
        ],
      },

      {
        title: "Грунтованный МДФ",
        products: [
          {
            title: "Грунтованный МДФ 16мм.",
            price: "6000",
            term: "8",
          },
          {
            title: "Грунтованный МДФ 16мм. (готовый под покраску)",
            price: "6800",
            term: "9",
          },
        ],
      },
      {
        title: "Образец цвета на МДФ 16 мм (размер 200мм*200мм)",
        products: [
          {
            title: "Матовый ",
            price: "300",
            term: "5",
          },
          {
            title: "Глянцевый",
            price: "400",
            term: "6",
          },
          {
            title: "<b>Матовый лак повышенной прочности 2 слоя</b>",
            price: "+1200",
            term: "-",
          },
        ],
      },
    ],
  },
  {
    title: "МДФ фасады  в пленке ПВХ " + "(макс. размер 2400мм*600мм)",
    categories: [
      {
        title: "",
        products: [
          {
            title: "До 4,5 м.кв.",
            price: "6200",
            term: "20",
          },
        ],
      },
      {
        title: "",
        products: [
          {
            title: "Более 4,5 м.кв.",
            price: "5600",
            term: "20",
          },
        ],
      },
      {
        title: "Фасады из ЛДСП ",
        products: [
          {
            title: "ЛДСП",
            price: "От 2500 руб./м² - по запросу",
            term: "От 4 - по запросу",
          },
        ],
      },
      {
        title: "Прочее ",
        products: [
          {
            title: "Присадки под петли, руб./шт.",
            price: "30",
            term: "1",
          },
          {
            title: "Отверстия под ручки, руб./шт.",
            price: "20",
            term: "1",
          },
        ],
      },
      {
        title: "МДФ не обработанный, ламинированный (белый) с одной стороны",
        products: [
          {
            title: "Толщина  16мм.,1 м.кв.",
            price: "1200",
            term: "1",
          },
          {
            title: "Толщина  19мм.,1 м.кв.",
            price: "1500",
            term: "1",
          },
          {
            title: "Раскрой 1м.",
            price: "30",
            term: "1",
          },
        ],
      },
      {
        title: "Дополнительные услуги",
        products: [
          {
            title: "Выезд на замер ",
            price: "500",
            term: "-",
          },
          {
            title: "Снятие фасадов,1 м.кв.",
            price: "600",
            term: "-",
          },
          {
            title: "Установка фасадов,1 м.кв.",
            price: "800",
            term: "-",
          },
        ],
      },
      {
        title: "Срочность изготовления заказа",
        products: [
          {
            title: "- 25 % от времени",
            price: "+25 % к стоимости",
            term: "",
          },
          {
            title: "- 50 % от времени",
            price: "+50 % к стоимости",
            term: "",
          },
        ],
      },
    ],
  },

  {
    title: "Дополнительно покрасочные работы",
    categories: [
      {
        title: "Дерево",
        products: [
          {
            title:
              "Дерево, массив с грунтованием:\nэмаль, без полировки (акрил, полиуретан, водоэмульсионная краска)\n",
            price: "3500",
            term: "1\n(2 материал на водной основе)\n",
          },
          {
            title: "Покрыть лаком, краской с перетиром (2 слоя)",
            price: "3000",
            term: "1",
          },
          {
            title: "Покрыть лаком, краской (без перетира)",
            price: "1000",
            term: "1",
          },
          {
            title: "Морилка +лак",
            price: "3500",
            term: "1",
          },
        ],
      },
      {
        title: "Пластик",
        products: [
          {
            title:
              "Пластик (техническая покраска) без предварительной подготовки",
            price: "800",
            term: "1",
          },
          {
            title:
              "Изделия из пластика с повышенным требованием к визуальным показателям (оконные рамы, элементы домашнего интерьера) покраска в камере:\n <b>Матовая эмаль</b> \n",
            price: "2500",
            term: "2",
          },
          {
            title:
              "Изделия из пластика с повышенным требованием к визуальным показателям (оконные рамы, элементы домашнего интерьера) покраска в камере: <b>Глянцевая эмаль, с полировкой</b>",
            price: "4200",
            term: "3",
          },
        ],
      },
      {
        title: "Металл",
        products: [
          {
            title:
              "Изделия из металла с повышенным требованием к визуальным показателям (оконные рамы, элементы домашнего интерьера) без предварительной подготовки без полировки, покраска  в камере",
            price: "1500",
            term: "1",
          },
          {
            title: "С предварительной подготовкой, с полировкой",
            price: "6000",
            term: "3",
          },
          {
            title:
              "Металлические конструкции (забор, оградки, оборудование и т.д.)(техническая покраска)\nбез предварительной подготовки, покраска в помещении\n",
            price: "200",
            term: "0,1",
          },
          {
            title: "С предварительной подготовкой",
            price: "500",
            term: "0,5",
          },
          {
            title: "Колеровка краски в цвет RAL,NCS услуги колориста ",
            price: "500",
            term: "",
          },
          {
            title: "Краска  в цвет RAL,NCS, 1л.",
            price: "От 900р.",
            term: "",
          },
          {
            title: "Лак глянцевый, 1л.",
            price: "1000",
            term: "",
          },
        ],
      },
    ],
  },
];
