interface Props {
  title: string;
  text?: string;
}

export const description: Props[] = [
  {
    title: "Гарантия",
    text: "На все виды работ - 5 лет",
  },
  {
    title: "Работает со всеми",
    text: "Готовы брать заказы с физическими и юридическими лицами",
  },
  {
    title: "Все виды услуг",
    text: "Готоы браться за любые заказы",
  },
  {
    title: "Скидки и акции",
    text: "Скидки постоянным клиентам, а также следите за нашими акциями",
  },
  {
    title: "Доставка",
    text: "По всей республике Коми, при некоторых условиях - Бесплатно",
  },
  {
    title: "Сотрудничество с партнерами",
  },
];
